In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
demo = pd.read_csv("CustomerDemographic.csv")
trans = pd.read_csv("Transactions.csv")
add = pd.read_csv("CustomerAddress.csv")

In [3]:
print("Customer_Demo: ", demo.shape)
print("Transaction: ", trans.shape)
print("Customer_add: ", add.shape)

Customer_Demo:  (4000, 14)
Transaction:  (20000, 13)
Customer_add:  (3999, 6)

In [4]:
demo.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,age,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,34,Jephthah,Bachmann,U,59,21/12/1843,NaN,Legal Assistant,IT,Affluent Customer,N,NaN,No,20.0
1,720,Darrel,Canet,Male,67,23/10/1931,NaN,Recruiting Manager,Retail,Affluent Customer,N,1;DROP TABLE users,No,6.0
2,1092,Katlin,Creddon,Female,56,22/08/1935,NaN,VP Quality Control,Retail,Mass Customer,N,ì¬íê³¼íì ì´íì°êµ¬ì,No,5.0
3,3410,Merrili,Brittin,Female,93,22/09/1940,NaN,NaN,Property,Mass Customer,N,á,No,16.0
4,2413,Abbey,Murrow,Male,27,11/08/1943,NaN,Environmental Specialist,Manufacturing,High Net Worth,N,á,Yes,17.0

## 1. Data Cleaning

 
* demo : { first_name , last_name, age, job_title, job_industry_category, default }  
  
  
* trans : Group_by customer_id and sum up the list price  

  
    
* add : Do nothing

#### Customer Demographics

In [5]:
cols_todrop = ['first_name' , 'last_name' , 'age', 'job_title', 'job_industry_category', 'default']
demo1 = demo.drop(columns = cols_todrop)

In [6]:
demo1.shape

(4000, 8)

#### Transactions

In [7]:
trans.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,25/2/2017,False,Approved,Solex,Standard,medium,medium,71.49,$53.62,41245.0
1,2,3,3120,21/5/2017,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,$388.92,41701.0
2,3,37,402,16/10/2017,False,Approved,OHM Cycles,Standard,low,medium,1793.43,$248.82,36361.0
3,4,88,3135,31/8/2017,False,Approved,Norco Bicycles,Standard,medium,medium,1198.46,$381.10,36145.0
4,5,78,787,1/10/2017,True,Approved,Giant Bicycles,Standard,medium,large,1765.30,$709.48,42226.0

In [8]:
ids = trans.groupby('customer_id')

In [9]:
trans_gpby = ids[['list_price']].agg(np.sum)

In [10]:
trans_gpby

             list_price
customer_id
1               9084.45
2               4149.07
3               9888.23
4               1047.72
5               5903.20
...                 ...
3497            3744.07
3498            5177.06
3499            7673.48
3500            4922.41
5034            1519.92

[3494 rows x 1 columns]

In [11]:
trans_gpby = trans_gpby.reset_index()

In [12]:
trans_id = tuple(trans['customer_id'])
demo_id = tuple(demo1['customer_id'])

In [13]:
customer_with_no_trans = [] # customer_ids with 0 transactions

for i in demo_id:
    
    if i not in trans_id:
        customer_with_no_trans.append(i)

In [14]:
len(customer_with_no_trans)

507

In [15]:
invalid_trans = []

for i in trans_id:
    
    if i not in demo_id:
        invalid_trans.append(i)

In [16]:
invalid_trans

[5034, 5034, 5034]

In [17]:
# Adding customer_id with 0 transaction to the dataframe
df = pd.DataFrame({
                  "customer_id": customer_with_no_trans,
                  "list_price" : np.nan
})

trans_final = trans_gpby.append(df)

/tmp/ipykernel_9177/938719868.py:7: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  trans_final = trans_gpby.append(df)

In [18]:
trans_final = trans_final.drop(labels = list(trans_final[trans_final['customer_id'] == 5034].index))

In [19]:
trans_final.head()

   customer_id  list_price
0            1     9084.45
1            2     4149.07
2            3     9888.23
3            4     1047.72
4            5     5903.20

In [20]:
trans1 = trans_final
print(trans1.shape)

(4000, 2)

#### Address

In [21]:
add_id = tuple(add['customer_id'])

In [22]:
invalid_customer_idx = []

for i in add_id:
    
    if i not in demo_id:
        invalid_customer_idx.append(add[add['customer_id'] == i].index[0])

In [23]:
invalid_customer_idx

[3996, 3997, 3998]

In [24]:
add1 = add.drop(labels = invalid_customer_idx)

In [25]:
add_id = tuple(add1['customer_id'])

customer_with_no_add = []

for j in demo_id:
    
    if j not in add_id:
        
        customer_with_no_add.append(j)

In [26]:
customer_with_no_add

[3, 22, 10, 23]

In [27]:
add1.shape

(3996, 6)

In [28]:
add1.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [29]:
df_add = pd.DataFrame({
                       "customer_id" : customer_with_no_add,
                       "address" : np.nan,
                       "postcode" : np.nan,
                       "state" : np.nan,
                       "country" : np.nan,
                       "property_valuation" : np.nan})

add_final = pd.concat([add1, df_add])

In [30]:
add_final.shape

(4000, 6)

### Joining the datasets

In [31]:
demo_trans = demo1.merge(trans1[['customer_id', 'list_price']], on = 'customer_id', how = 'left')
demo_trans.head()

,customer_id,gender,past_3_years_bike_related_purchases,DOB,wealth_segment,deceased_indicator,owns_car,tenure,list_price
0,34,U,59,21/12/1843,Affluent Customer,N,No,20.0,13133.00
1,720,Male,67,23/10/1931,Affluent Customer,N,No,6.0,13004.35
2,1092,Female,56,22/08/1935,Mass Customer,N,No,5.0,4893.72
3,3410,Female,93,22/09/1940,Mass Customer,N,No,16.0,2965.89
4,2413,Male,27,11/08/1943,High Net Worth,N,Yes,17.0,8666.87

In [32]:
demo_trans.shape

(4000, 9)

In [33]:
joined_df = demo_trans.merge(add_final[['customer_id','address', 'postcode', 'state', 'country', 'property_valuation']],
                             on = 'customer_id', how = 'left')
joined_df.head()

,customer_id,gender,past_3_years_bike_related_purchases,DOB,wealth_segment,deceased_indicator,owns_car,tenure,list_price,address,postcode,state,country,property_valuation
0,34,U,59,21/12/1843,Affluent Customer,N,No,20.0,13133.00,833 Luster Way,4005.0,QLD,Australia,8.0
1,720,Male,67,23/10/1931,Affluent Customer,N,No,6.0,13004.35,78 Glacier Hill Drive,2026.0,NSW,Australia,10.0
2,1092,Female,56,22/08/1935,Mass Customer,N,No,5.0,4893.72,5515 Artisan Center,3337.0,VIC,Australia,3.0
3,3410,Female,93,22/09/1940,Mass Customer,N,No,16.0,2965.89,1351 Lunder Road,2049.0,NSW,Australia,10.0
4,2413,Male,27,11/08/1943,High Net Worth,N,Yes,17.0,8666.87,423 Debra Terrace,3082.0,VIC,Australia,8.0

In [34]:
joined_df.shape

(4000, 14)

## 2. Data Preprocessing

In [35]:
data = joined_df.copy()
data.head()

,customer_id,gender,past_3_years_bike_related_purchases,DOB,wealth_segment,deceased_indicator,owns_car,tenure,list_price,address,postcode,state,country,property_valuation
0,34,U,59,21/12/1843,Affluent Customer,N,No,20.0,13133.00,833 Luster Way,4005.0,QLD,Australia,8.0
1,720,Male,67,23/10/1931,Affluent Customer,N,No,6.0,13004.35,78 Glacier Hill Drive,2026.0,NSW,Australia,10.0
2,1092,Female,56,22/08/1935,Mass Customer,N,No,5.0,4893.72,5515 Artisan Center,3337.0,VIC,Australia,3.0
3,3410,Female,93,22/09/1940,Mass Customer,N,No,16.0,2965.89,1351 Lunder Road,2049.0,NSW,Australia,10.0
4,2413,Male,27,11/08/1943,High Net Worth,N,Yes,17.0,8666.87,423 Debra Terrace,3082.0,VIC,Australia,8.0

In [36]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4000 entries, 0 to 3999
Data columns (total 14 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   gender                               4000 non-null   object
 2   past_3_years_bike_related_purchases  4000 non-null   int64
 3   DOB                                  3913 non-null   object
 4   wealth_segment                       4000 non-null   object
 5   deceased_indicator                   4000 non-null   object
 6   owns_car                             4000 non-null   object
 7   tenure                               3913 non-null   float64
 8   list_price                           3493 non-null   float64
 9   address                              3996 non-null   object
 10  postcode                             3996 non-null   float64
 11  state                                3996 non-null   object
 12  country                              3996 non-null   object
 13  property_valuation                   3996 non-null   float64
dtypes: float64(4), int64(2), object(8)
memory usage: 468.8+ KB

In [37]:
data.isnull().sum()

customer_id                              0
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
list_price                             507
address                                  4
postcode                                 4
state                                    4
country                                  4
property_valuation                       4
dtype: int64

In [38]:
from datetime import datetime, date

def calculate_age(born):
    if type(born) != float:
        
        born = datetime.strptime(born, "%d/%m/%Y").date()
        today = date.today()
        return today.year - born.year - ((today.month, today.day) < (born.month, born.day))
    
    else:
        return 0

data['age'] = data['DOB'].apply(calculate_age)
data.drop(columns = ['DOB'], inplace = True)

In [39]:
data.head()

,customer_id,gender,past_3_years_bike_related_purchases,wealth_segment,deceased_indicator,owns_car,tenure,list_price,address,postcode,state,country,property_valuation,age
0,34,U,59,Affluent Customer,N,No,20.0,13133.00,833 Luster Way,4005.0,QLD,Australia,8.0,179
1,720,Male,67,Affluent Customer,N,No,6.0,13004.35,78 Glacier Hill Drive,2026.0,NSW,Australia,10.0,91
2,1092,Female,56,Mass Customer,N,No,5.0,4893.72,5515 Artisan Center,3337.0,VIC,Australia,3.0,87
3,3410,Female,93,Mass Customer,N,No,16.0,2965.89,1351 Lunder Road,2049.0,NSW,Australia,10.0,82
4,2413,Male,27,High Net Worth,N,Yes,17.0,8666.87,423 Debra Terrace,3082.0,VIC,Australia,8.0,79

In [40]:
def age_group(a):
    
    if 10 <= a < 20:
        return "10-20"
    
    elif 20 <= a < 30:
        return "20-30"
    
    elif 30 <= a < 40:
        return "30-40"
    
    elif 40 <= a < 50:
        return "40-50"
    
    elif 50 <= a < 60:
        return "50-60"
    
    elif 60 <= a < 70:
        return "60-70"
    
    elif 70 <= a < 80:
        return "70-80"
    
    elif 80 <= a < 90:
        return "80-90"
    
    elif 90 <= a < 100:
        return "90-100"
    
    else:
        return "Not Available"
    
data['age_group'] = data['age'].apply(age_group)
data.drop(columns = ['age'], inplace = True )

In [41]:
data.head()

,customer_id,gender,past_3_years_bike_related_purchases,wealth_segment,deceased_indicator,owns_car,tenure,list_price,address,postcode,state,country,property_valuation,age_group
0,34,U,59,Affluent Customer,N,No,20.0,13133.00,833 Luster Way,4005.0,QLD,Australia,8.0,Not Available
1,720,Male,67,Affluent Customer,N,No,6.0,13004.35,78 Glacier Hill Drive,2026.0,NSW,Australia,10.0,90-100
2,1092,Female,56,Mass Customer,N,No,5.0,4893.72,5515 Artisan Center,3337.0,VIC,Australia,3.0,80-90
3,3410,Female,93,Mass Customer,N,No,16.0,2965.89,1351 Lunder Road,2049.0,NSW,Australia,10.0,80-90
4,2413,Male,27,High Net Worth,N,Yes,17.0,8666.87,423 Debra Terrace,3082.0,VIC,Australia,8.0,70-80

In [42]:
data.isnull().sum()

customer_id                              0
gender                                   0
past_3_years_bike_related_purchases      0
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
list_price                             507
address                                  4
postcode                                 4
state                                    4
country                                  4
property_valuation                       4
age_group                                0
dtype: int64

In [43]:
data['gender'] = data['gender'].replace({"Female" : "F" , "Male" : "M" , "Femal" : "F"})

In [44]:
data['gender'].unique()

array(['U', 'M', 'F'], dtype=object)

In [45]:
data['state'] = data['state'].replace({"Victoria" : "VIC" , "New South Wales" : "NSW" })

In [46]:
data['state'].unique()

array(['QLD', 'NSW', 'VIC', nan], dtype=object)

In [47]:
data.drop(columns = ['address'], inplace = True)

### Filling Missing Values

In [48]:
postcode_mode = data['postcode'].mode()[0]
state_mode = data['state'].mode()[0]
country_mode = data['country'].mode()[0]

#print(country_mode[0])

In [49]:
data['postcode'] = data['postcode'].replace(np.nan , postcode_mode)
data['state'] = data['state'].replace(np.nan , state_mode)
data['country'] = data['country'].replace(np.nan , country_mode)

In [50]:
prop_mean = data['property_valuation'].mean()
data['property_valuation'] = data['property_valuation'].replace(np.nan , prop_mean)

In [51]:
data.isnull().sum()

customer_id                              0
gender                                   0
past_3_years_bike_related_purchases      0
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
list_price                             507
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
age_group                                0
dtype: int64

In [53]:
data.to_csv("preprocessed_data.csv" , index = False)

## Data Modelling

In [2]:
data = pd.read_csv("preprocessed_data.csv")
data.head()

,customer_id,gender,past_3_years_bike_related_purchases,wealth_segment,deceased_indicator,owns_car,tenure,list_price,postcode,state,country,property_valuation,age_group
0,34,U,59,Affluent Customer,N,No,20.0,13133.00,4005.0,QLD,Australia,8.0,Not Available
1,720,M,67,Affluent Customer,N,No,6.0,13004.35,2026.0,NSW,Australia,10.0,90-100
2,1092,F,56,Mass Customer,N,No,5.0,4893.72,3337.0,VIC,Australia,3.0,80-90
3,3410,F,93,Mass Customer,N,No,16.0,2965.89,2049.0,NSW,Australia,10.0,80-90
4,2413,M,27,High Net Worth,N,Yes,17.0,8666.87,3082.0,VIC,Australia,8.0,70-80

In [4]:
a = data['postcode'].unique()
len(a)

873